def get_val(collection, key, default='git'):
    """Функция возвращает значение из словаря по переданному ключу, если ключ существует. В ином случае возвращается значение
default"""

    try:
        collection[key]
    except KeyError:
        return default

    return collection[key]


def test_get_val():
    assert get_val({"Мандаринки": 150, "Шоколадные конфеты": 200, "Гирлянда": 400}, "Мандаринки") == 150
    assert get_val({"Мандаринки": 150, "Шоколадные конфеты": 200, "Гирлянда": 400}, "Мандаринки", "150") == 150
    assert get_val({"Мандаринки": 150, "Шоколадные конфеты": 200, "Гирлянда": 400}, "Мандаринки", "git") == 150
    assert get_val({"Мандаринки": 150, "Шоколадные конфеты": 200, "Гирлянда": 400}, "Шоколадные конфеты") == 200
    assert get_val({"Мандаринки": 150, "Шоколадные конфеты": 200, "Гирлянда": 400}, "Гирлянда") == 400
    assert get_val({}, "vcs", "git") == "git"
    assert get_val({}, "vcs", "bazaar") == "bazaar"
